GetExternalResourceReferenceExpanded Method
 Gets the collection of ExternalResourceReference associated with a specified external resource type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public IList<ExternalResourceReference> GetExternalResourceReferenceExpanded(
	ExternalResourceType resourceType
)
Visual Basic
Public Function GetExternalResourceReferenceExpanded ( _
	resourceType As ExternalResourceType _
) As IList(Of ExternalResourceReference)
Visual C++
public:
IList<ExternalResourceReference^>^ GetExternalResourceReferenceExpanded(
	ExternalResourceType^ resourceType
)
Parameters
resourceType
Type: Autodesk.Revit.DBExternalResourceType
 The desired external resource type.
Return Value
 The collection of the ExternalResourceReference associated with a specified external resource type.
Remarks
 Use this API for an element which has multiple external resource references under a specified type, e.g., AppearanceAssetElement. See also: [!:Autodesk::Revit::DB::Element::getExternalResourceReference].
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentException |  This Element does not use a resource reference for the specified resource type.
Autodesk.Revit.ExceptionsArgumentNullException |  A non-optional argument was null
See Also
Element Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →